In [ ]:
# PANDAS

In [ ]:
! pip show Pandas

Name: pandas
Version: 1.1.5
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: /usr/local/lib/python3.7/dist-packages
Requires: numpy, pytz, python-dateutil
Required-by: xarray, vega-datasets, statsmodels, sklearn-pandas, seaborn, pymc3, plotnine, pandas-profiling, pandas-gbq, pandas-datareader, mlxtend, mizani, holoviews, gspread-dataframe, google-colab, fix-yahoo-finance, fbprophet, fastai, cufflinks, cmdstanpy, arviz, altair

In [ ]:
# Installation
# pip install pandas

In [ ]:
import pandas as pd

In [ ]:
pd.__version__

'1.1.5'

In [ ]:
df = pd.read_csv("/content/adult.data", header= None)

In [ ]:
df.head()

   0                  1       2           3   ...  11  12              13      14
0  39          State-gov   77516   Bachelors  ...   0  40   United-States   <=50K
1  50   Self-emp-not-inc   83311   Bachelors  ...   0  13   United-States   <=50K
2  38            Private  215646     HS-grad  ...   0  40   United-States   <=50K
3  53            Private  234721        11th  ...   0  40   United-States   <=50K
4  28            Private  338409   Bachelors  ...   0  40            Cuba   <=50K

[5 rows x 15 columns]

In [ ]:
df.tail(5)

       0              1       2            3   ...  11  12              13      14
32556  27        Private  257302   Assoc-acdm  ...   0  38   United-States   <=50K
32557  40        Private  154374      HS-grad  ...   0  40   United-States    >50K
32558  58        Private  151910      HS-grad  ...   0  40   United-States   <=50K
32559  22        Private  201490      HS-grad  ...   0  20   United-States   <=50K
32560  52   Self-emp-inc  287927      HS-grad  ...   0  40   United-States    >50K

[5 rows x 15 columns]

In [ ]:
df.sample(5) #random 5 lines of data

       0           1       2              3   ...  11  12              13      14
2530   21     Private  294789   Some-college  ...   0  25   United-States   <=50K
4878   46     Private   72619   Some-college  ...   0  40   United-States    >50K
13019  49   State-gov  154493        HS-grad  ...   0  44   United-States   <=50K
9334   22     Private  216867        7th-8th  ...   0  40          Mexico   <=50K
7186   19     Private  188815        HS-grad  ...   0  20   United-States   <=50K

[5 rows x 15 columns]

In [ ]:
col_name=[
'age', 
'workclass',
'fnlwgt',
'education',
'EducationNum',
'MaritaStatus',
'occupation',
'relationship',
'race',
'sex',
'CapitalGain',
'CapitalLoss',
'HoursPerWeek',
'NativeC=ountry',
'above50k'
]

In [ ]:
# Change your column name

In [ ]:
df.columns

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], dtype='int64')

In [ ]:
df.columns = col_name

In [ ]:
df.head()

   age          workclass  fnlwgt  ... HoursPerWeek  NativeC=ountry above50k
0   39          State-gov   77516  ...           40   United-States    <=50K
1   50   Self-emp-not-inc   83311  ...           13   United-States    <=50K
2   38            Private  215646  ...           40   United-States    <=50K
3   53            Private  234721  ...           40   United-States    <=50K
4   28            Private  338409  ...           40            Cuba    <=50K

[5 rows x 15 columns]

In [ ]:
# pandas cannot only read csv, but also other files

In [ ]:
df.shape

(32561, 15)

In [ ]:
df.age

0        39
1        50
2        38
3        53
4        28
         ..
32556    27
32557    40
32558    58
32559    22
32560    52
Name: age, Length: 32561, dtype: int64

In [ ]:
df[['age','education']]

       age    education
0       39    Bachelors
1       50    Bachelors
2       38      HS-grad
3       53         11th
4       28    Bachelors
...    ...          ...
32556   27   Assoc-acdm
32557   40      HS-grad
32558   58      HS-grad
32559   22      HS-grad
32560   52      HS-grad

[32561 rows x 2 columns]

In [ ]:
# Indexing
# Loc

In [ ]:
# dataframe.loc[rowname, columnname]

In [ ]:
df.loc[2,'education']

' HS-grad'

In [ ]:
df.loc[2, ['age', 'education']]

age                38
education     HS-grad
Name: 2, dtype: object

In [ ]:
df.loc[2:10, ['age', 'education']]

    age      education
2    38        HS-grad
3    53           11th
4    28      Bachelors
5    37        Masters
6    49            9th
7    52        HS-grad
8    31        Masters
9    42      Bachelors
10   37   Some-college

In [ ]:
# .iloc
# Syntax --> df.iloc[row_number, column_number]

In [ ]:
df.iloc[2:10, 1:5] # Golden rule of counting numbers is applied here

           workclass  fnlwgt   education  EducationNum
2            Private  215646     HS-grad             9
3            Private  234721        11th             7
4            Private  338409   Bachelors            13
5            Private  284582     Masters            14
6            Private  160187         9th             5
7   Self-emp-not-inc  209642     HS-grad             9
8            Private   45781     Masters            14
9            Private  159449   Bachelors            13

In [ ]:
# df.loc
# 1. Helps with the location of data
# 2. Also helps in filtering data

In [ ]:
# df.loc(filtering of row(condition), column_names)

In [ ]:
df.loc[df.age>35, ['age', 'education']]

       age   education
0       39   Bachelors
1       50   Bachelors
2       38     HS-grad
3       53        11th
5       37     Masters
...    ...         ...
32552   43   Assoc-voc
32554   53     Masters
32557   40     HS-grad
32558   58     HS-grad
32560   52     HS-grad

[17636 rows x 2 columns]

In [ ]:
# Q. Girls who are in 11 th standard
# Interpretation and condition--> Gender = female and education = 11th

In [ ]:
# Syntax--> df.loc[ (rowcondition1) & (row condytion2),  ['c1', 'c2','c3'....]]

In [ ]:
df.sex.unique()

array([' Male', ' Female'], dtype=object)

In [ ]:
df.loc[ (df.sex ==' Female') & (df.education == ' 11th'), [ "age", "sex", "education"]]

       age      sex education
78      18   Female      11th
205     18   Female      11th
209     17   Female      11th
323     29   Female      11th
417     30   Female      11th
...    ...      ...       ...
32220   19   Female      11th
32335   18   Female      11th
32349   36   Female      11th
32423   61   Female      11th
32493   24   Female      11th

[432 rows x 3 columns]

In [ ]:
# Q. Adult and Less educated

In [ ]:
df.education.unique() # Different variable in the column

array([' Bachelors', ' HS-grad', ' 11th', ' Masters', ' 9th',
       ' Some-college', ' Assoc-acdm', ' Assoc-voc', ' 7th-8th',
       ' Doctorate', ' Prof-school', ' 5th-6th', ' 10th', ' 1st-4th',
       ' Preschool', ' 12th'], dtype=object)

In [ ]:
df.education.value_counts() # total number of values in unique variable

 HS-grad         10501
 Some-college     7291
 Bachelors        5355
 Masters          1723
 Assoc-voc        1382
 11th             1175
 Assoc-acdm       1067
 10th              933
 7th-8th           646
 Prof-school       576
 9th               514
 12th              433
 Doctorate         413
 5th-6th           333
 1st-4th           168
 Preschool          51
Name: education, dtype: int64

In [ ]:
df.education.value_counts()[:3] #value count for top three unique values

 HS-grad         10501
 Some-college     7291
 Bachelors        5355
Name: education, dtype: int64

In [ ]:
df.loc[(df.age>35) & (df.education == " HS-grad") & (df.HoursPerWeek> 20), ['age', 'education', 'sex', 'HoursPerWeek']]

       age education      sex  HoursPerWeek
2       38   HS-grad     Male            40
7       52   HS-grad     Male            45
24      59   HS-grad   Female            40
28      39   HS-grad     Male            80
29      49   HS-grad     Male            40
...    ...       ...      ...           ...
32542   72   HS-grad     Male            25
32547   43   HS-grad     Male            40
32557   40   HS-grad     Male            40
32558   58   HS-grad   Female            40
32560   52   HS-grad   Female            40

[5307 rows x 4 columns]

In [ ]:
# & or And Operator - Both of the condition need to be true for output
# | or OR Operator - Anyone of the conditions need to be true

In [ ]:
df.loc[(df.education== " 12th") | (df.education == " HS-grad") & (df.HoursPerWeek > 35), ['age', 'education', 'sex', 'HoursPerWeek']]

       age education      sex  HoursPerWeek
2       38   HS-grad     Male            40
7       52   HS-grad     Male            45
17      32   HS-grad     Male            40
24      59   HS-grad   Female            40
26      19   HS-grad     Male            40
...    ...       ...      ...           ...
32540   45   HS-grad   Female            40
32547   43   HS-grad     Male            40
32557   40   HS-grad     Male            40
32558   58   HS-grad   Female            40
32560   52   HS-grad   Female            40

[8954 rows x 4 columns]

In [ ]:
#################################

# 1. () - For functions
# 2. [] - For indexing, slicing, list